src/test/resources/data/readable/RCMR_IN010000UK05/MessageBody/envelope.xml

<soap:Envelope xmlns:eb="http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd"
               xmlns:hl7ebxml="urn:hl7-org:transport/ebxml/DSTUv1.0"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <eb:MessageHeader eb:version="2.0" soap:mustUnderstand="1">
            <eb:From>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">A91720-9198820</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId eb:type="urn:nhs:names:partyType:ocs+serviceInstance">A91368-9199177</eb:PartyId>
            </eb:To>
            <eb:CPAId>1b09c9557a7794ff6fd2</eb:CPAId>
            <eb:ConversationId>17a757f2-f4d2-444e-a246-9cb77bef7f22</eb:ConversationId>
            <eb:Service>urn:nhs:names:services:gp2gp</eb:Service>
            <eb:Action>RCMR_IN010000UK05</eb:Action>
            <eb:MessageData>
                <eb:MessageId>C445C720-B0EB-4E36-AF8A-48CD1CA5DE4F</eb:MessageId>
                <eb:Timestamp>2020-12-18T17:36:38.827Z</eb:Timestamp>
                <eb:TimeToLive>2020-12-18T23:51:38.827Z</eb:TimeToLive>
            </eb:MessageData>
            <eb:DuplicateElimination/>
        </eb:MessageHeader>
        <eb:AckRequested eb:version="2.0" soap:mustUnderstand="1"
                         soap:actor="urn:oasis:names:tc:ebxml-msg:actor:nextMSH" eb:signed="false"/>
    </soap:Header>
    <soap:Body>
        <eb:Manifest eb:version="2.0" soap:mustUnderstand="1">
            <eb:Reference xlink:href="cid:Content1@e-mis.com/EMISWeb/GP2GP2.2A"
                          xmlns:xlink="http://www.w3.org/1999/xlink">
                <eb:Description xml:lang="en">RCMR_IN010000UK05</eb:Description>
                <hl7ebxml:Payload style="HL7" encoding="XML" version="3.0"/>
            </eb:Reference>
        </eb:Manifest>
    </soap:Body>
</soap:Envelope>